# Sub-Queries and Temporary Tables

We connect to MySQL server and workbench and make analysis with the parch-and-posey database. This course is the practicals of the course SQL for Data Analysis at Udacity.

In [1]:
# we import some required libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from pprint import pprint
import time
print('Done!')

Done!

**Next, we create a connection to the parch-and-posey DataBase in MySQL Work-Bench**

In [2]:
import mysql
from mysql.connector import Error
from getpass import getpass

try:
    connection = mysql.connector.connect(host='localhost',
                                         database='parch_and_posey',
                                         user=input('Enter UserName:'),
                                         password=getpass('Enter Password:'))
    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL Server version ", db_Info)
        cursor = connection.cursor()
        cursor.execute("select database();")
        record = cursor.fetchone()
        print("You're connected to database: ", record)

except Error as e:
    print("Error while connecting to MySQL", e)

Enter UserName:danam
Enter Password:········
Connected to MySQL Server version  8.0.24
You're connected to database:  ('parch_and_posey',)

In [3]:
# Let's see the tables in the database

# let's run the show tables command 

cursor.execute('show tables')
out = cursor.fetchall()
out

[('accounts',), ('orders',), ('region',), ('sales_reps',), ('web_events',)]

**Defining a method that converts the result of a query to a dataframe**

In [4]:
def query_to_df(query):
    st = time.time()
    # Assert Every Query ends with a semi-colon
    try:
        assert query.endswith(';')
    except AssertionError:
        return 'ERROR: Query Must End with ;'

    # so we never have more than 20 rows displayed
    pd.set_option('display.max_rows', 20) 
    df = None

    # Process the query
    cursor.execute(query)
    columns = cursor.description
    result = []
    for value in cursor.fetchall():
        tmp = {}
        for (index,column) in enumerate(value):
            tmp[columns[index][0]] = [column]
        result.append(tmp)

    # Create a DataFrame from all results
    for ind, data in enumerate(result):
        if ind >= 1:
            x = pd.DataFrame(data)
            df = pd.concat([df, x], ignore_index=True)
        else:
            df = pd.DataFrame(data)
    print(f'Query ran for {time.time()-st} secs!')
    return df

In [5]:
# 1. For the accounts table

query = 'SELECT * FROM accounts LIMIT 3;'
query_to_df(query)

Query ran for 0.007980108261108398 secs!

,id,name,website,lat,longs,primary_poc,sales_rep_id
0,1001,Walmart,www.walmart.com,40.23849561,-75.10329704,Tamara Tuma,321500
1,1011,Exxon Mobil,www.exxonmobil.com,41.16915630,-73.84937379,Sung Shields,321510
2,1021,Apple,www.apple.com,42.29049481,-76.08400942,Jodee Lupo,321520

In [6]:
# 2. For the orders table

query = 'SELECT * FROM orders LIMIT 3;'
query_to_df(query)

Query ran for 0.009941816329956055 secs!

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1,1001,2015-10-06 17:31:14,123,22,24,169,613.77,164.78,194.88,973.43
1,2,1001,2015-11-05 03:34:33,190,41,57,288,948.10,307.09,462.84,1718.03
2,3,1001,2015-12-04 04:21:55,85,47,0,132,424.15,352.03,0.00,776.18

In [7]:
# 3. For the sales_reps table

query = 'SELECT * FROM sales_reps LIMIT 3;'
query_to_df(query)

Query ran for 0.006982564926147461 secs!

       id             name  region_id
0  321500    Samuel Racine          1
1  321510     Eugena Esser          1
2  321520  Michel Averette          1

In [8]:
# 4. For the web_events table

query = 'SELECT * FROM web_events LIMIT 3;'
query_to_df(query)

Query ran for 0.007975578308105469 secs!

   id  account_id         occurred_at channel
0   1        1001 2015-10-06 17:13:58  direct
1   2        1001 2015-11-05 03:08:26  direct
2   3        1001 2015-12-04 03:57:24  direct

In [9]:
# 5. For the region table

query = 'SELECT * FROM region LIMIT 3;'
query_to_df(query)

Query ran for 0.004987001419067383 secs!

   id       name
0   1  Northeast
1   2    Midwest
2   3  Southeast

## SubQueries:

AKA **Inner-queries or Nested-Queries** are tools for performing operations in multiple steps.

### More Subquery Tips:

* The original query goes in the `FROM` statement
* An `*` is used in the `SELECT` statement to pull all data from the original query
* You must use an alias for the table you nest within the outer query

**EX 1: Use a subquery to find the average number of events that occur per day per channel**

In [37]:
query_to_df(
"SELECT DATE(occurred_at) date, channel, COUNT(*) num_events \
FROM web_events GROUP BY 1, 2 ORDER BY 1;"
)

Query ran for 3.3873486518859863 secs!

            date   channel  num_events
0     2013-12-04   adwords           1
1     2013-12-04    direct           2
2     2013-12-04  facebook           1
3     2013-12-05   adwords           1
4     2013-12-05    direct           1
...          ...       ...         ...
3559  2017-01-01   adwords           4
3560  2017-01-01    banner           2
3561  2017-01-01    direct          21
3562  2017-01-01   organic           3
3563  2017-01-01   twitter           1

[3564 rows x 3 columns]

**EX 2: Use a subquery to find the average number of events that occur per channel**

In [38]:
query_to_df(
"SELECT channel, AVG(num_events) avg_num_events FROM \
(SELECT DATE(occurred_at) date, channel, COUNT(*) num_events \
FROM web_events GROUP BY 1, 2 ORDER BY 1) as sub GROUP BY 1 ORDER BY 2 DESC;"
)

Query ran for 0.029919862747192383 secs!

    channel avg_num_events
0    direct         4.8965
1   organic         1.6673
2  facebook         1.5983
3   adwords         1.5702
4   twitter         1.3167
5    banner         1.2900

**EX 3. On which day-channel pair did the most events occur**

In [36]:
query_to_df(
"SELECT DATE(occurred_at) date, channel, COUNT(*) num_events \
FROM web_events GROUP BY 1, 2 ORDER BY 3 DESC LIMIT 5;"
)

Query ran for 0.030946731567382812 secs!

         date channel  num_events
0  2017-01-01  direct          21
1  2016-12-21  direct          21
2  2016-12-31  direct          19
3  2016-11-03  direct          18
4  2016-12-28  direct          17

## Subquery Formatting

When writing Subqueries, it is easy for your query to look incredibly complex. In order to assist your reader, which is often just yourself at a future date, formatting SQL will help with understanding your code.

The important thing to remember when using subqueries is to provide some way for the reader to easily determine which parts of the query will be executed together. Most people do this by indenting the subquery in some way

### Well Formatted Query:
```
SELECT *
FROM (SELECT DATE_TRUNC('day',occurred_at) AS day,
                channel, COUNT(*) as events
      FROM web_events 
      GROUP BY 1,2
      ORDER BY 3 DESC) sub;
```

Additionally, if we have a GROUP BY, ORDER BY, WHERE, HAVING, or any other statement following our subquery, we would then indent it at the same level as our outer query.

The query below is similar to the above, but it is applying additional statements to the outer query, so you can see there are GROUP BY and ORDER BY statements used on the output are not tabbed. The inner query GROUP BY and ORDER BY statements are indented to match the inner table.
```
SELECT *
FROM (SELECT DATE_TRUNC('day',occurred_at) AS day,
                channel, COUNT(*) as events
      FROM web_events 
      GROUP BY 1,2
      ORDER BY 3 DESC) sub
GROUP BY day, channel, events
ORDER BY 2 DESC;
```

### MORE on Subquery:

Subqueries can be used in several places within a query, it can be used anywhere we might use a table name or even a column name or an individual value. 
* They are especially useful in conditional logic in conjunction with `Where` and `Join` clauses or in the `WHEN` portion of a `CASE` statement.
* Most conditional logic, would work with sub-queries containing one-cell results. But `IN` is the only type of conditional logic that will work when the inner query contains multiple results.

### Expert Tip
Note that you should not include an alias when you write a subquery in a conditional statement. This is because the subquery is treated as an individual value (or set of values in the IN case) rather than as a table.

Also, notice the query here compared a single value. If we returned an entire column IN would need to be used to perform a logical argument. If we are returning an entire table, then we must use an ALIAS for the table, and perform additional logic on the entire table.

**EXERCISE**:

You should write your solution as a subquery or subqueries, not by finding one solution and copying the output. The importance of this is that it allows your query to be dynamic in answering the question - even if the data changes, you still arrive at the right answer.

**1. Use Sub-queries to return orders that only took place in the same month and year as the first ever order**

In [52]:
query_to_df(
"SELECT * FROM ORDERS WHERE EXTRACT(YEAR_MONTH FROM occurred_at) = \
(SELECT EXTRACT(YEAR_MONTH FROM MIN(occurred_at)) first_order_month FROM orders)\
ORDER BY occurred_at;"
)

Query ran for 0.21522974967956543 secs!

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,5786,2861,2013-12-04 04:22:44,0,48,33,81,0.00,359.52,267.96,627.48
1,2415,2861,2013-12-04 04:45:54,490,15,11,516,2445.10,112.35,89.32,2646.77
2,4108,4311,2013-12-04 04:53:25,528,10,0,538,2634.72,74.90,0.00,2709.62
3,4489,1281,2013-12-05 20:29:16,0,37,0,37,0.00,277.13,0.00,277.13
4,287,1281,2013-12-05 20:33:56,492,73,0,565,2455.08,546.77,0.00,3001.85
...,...,...,...,...,...,...,...,...,...,...,...
94,4756,1521,2013-12-31 00:18:22,10,60,29,99,49.90,449.40,235.48,734.78
95,702,1521,2013-12-31 00:36:59,266,0,26,292,1327.34,0.00,211.12,1538.46
96,3057,3371,2013-12-31 02:04:00,79,75,14,168,394.21,561.75,113.68,1069.64
97,2764,3101,2013-12-31 12:58:47,119,36,0,155,593.81,269.64,0.00,863.45
98,5979,3101,2013-12-31 13:14:55,485,191,0,676,2420.15,1430.59,0.00,3850.74

**2. From the above result, use Sub-queries to return the average qty for each type of paper sold during this same first month as well as the total sales in USD for this month.**

In [59]:
query_to_df(
"SELECT EXTRACT(YEAR_MONTH FROM occurred_at) Date, \
AVG(standard_qty), AVG(gloss_qty), AVG(poster_qty), SUM(total_amt_usd) FROM \
(SELECT * FROM ORDERS WHERE EXTRACT(YEAR_MONTH FROM occurred_at) = \
(SELECT EXTRACT(YEAR_MONTH FROM MIN(occurred_at)) FROM orders)\
ORDER BY occurred_at) as sub;"
)

Query ran for 0.024964332580566406 secs!

     Date AVG(standard_qty) AVG(gloss_qty) AVG(poster_qty) SUM(total_amt_usd)
0  201312          268.2222       208.9495        111.8182          377331.00

**3. Use subqueries to Provide the name of the sales_rep in each region with the largest amount of total_amt_usd sales.**

In [141]:
query_to_df(
"SELECT * FROM (SELECT s.name sales_rep, r.name region, SUM(o.total_amt_usd) total_amt_usd \
FROM sales_reps s JOIN region r ON s.region_id=r.id JOIN accounts a ON \
a.sales_rep_id=s.id JOIN orders o ON o.account_id=a.id GROUP BY 1, 2 ORDER BY 2, 3 DESC) AS sub GROUP BY 2;"
)

Query ran for 0.0329132080078125 secs!

             sales_rep     region total_amt_usd
0      Charles Bidwell    Midwest     675637.19
1            Tia Amato  Northeast    1010690.60
2    Earlie Schleusner  Southeast    1098137.72
3  Georgianna Chisholm       West     886244.12

**4. For the region with the largest (sum) of sales total_amt_usd, how many total (count) orders were placed?**

In [105]:
query_to_df(
'SELECT r.name region, COUNT(o.id) total_orders FROM region r JOIN sales_reps s \
ON s.region_id=r.id JOIN accounts a ON a.sales_rep_id=s.id JOIN orders o ON o.account_id=a.id \
WHERE r.name=(SELECT region FROM \
(SELECT r.name region, SUM(o.total_amt_usd) total_amt_usd FROM region r JOIN sales_reps s ON s.region_id=r.id \
JOIN accounts a ON a.sales_rep_id=s.id JOIN orders o ON o.account_id=a.id GROUP BY 1 ORDER BY 2 DESC LIMIT 1) AS sub);'
)

Query ran for 0.02695941925048828 secs!

      region  total_orders
0  Northeast          2357

**5. How many accounts had more total purchases than the account name which has bought the most standard_qty paper throughout their lifetime as a customer?**

In [139]:
query_to_df(
"SELECT COUNT(*) count FROM \
(SELECT a.name acct_name FROM accounts a JOIN orders o ON a.id=o.account_id GROUP BY a.name HAVING \
SUM(o.total) > (SELECT total_qty FROM \
(SELECT a.name acct_name, SUM(o.standard_qty) total_std_qty, SUM(o.total) total_qty FROM accounts a \
JOIN orders o ON a.id=o.account_id GROUP BY 1 ORDER BY 2 DESC LIMIT 1) AS inner_tab)) outer_tab;"
)

Query ran for 0.031914472579956055 secs!

   count
0      3

**6. For the customer that spent the most (in total over their lifetime as a customer) total_amt_usd, how many web_events did they have for each channel?**

In [166]:
query_to_df(
"SELECT a.name acct_name, w.channel channel, COUNT(w.id) web_events FROM accounts a JOIN web_events w ON \
w.account_id=a.id WHERE a.name = \
(SELECT name FROM \
(SELECT a.name, SUM(o.total) total_sum_usd FROM accounts a JOIN orders o ON a.id=o.account_id \
GROUP BY 1 ORDER BY 2 DESC LIMIT 1) AS name) GROUP BY 1, 2;"
)

Query ran for 0.03091883659362793 secs!

       acct_name   channel  web_events
0  EOG Resources    direct          44
1  EOG Resources  facebook          11
2  EOG Resources   twitter           5
3  EOG Resources   adwords          12
4  EOG Resources   organic          13
5  EOG Resources    banner           4

**7. What is the lifetime average amount spent in terms of total_amt_usd for the top 10 total spending accounts?**

In [187]:
query_to_df(
"SELECT AVG(total_amt_usd) AVG_lifetime_spend_top_10_accounts FROM \
(SELECT a.name acct_name, SUM(o.total_amt_usd) total_amt_usd FROM accounts a JOIN orders o \
ON a.id=o.account_id GROUP BY 1 ORDER BY 2 DESC LIMIT 10) as avg;"
)

Query ran for 0.023934364318847656 secs!

  AVG_lifetime_spend_top_10_accounts
0                      304846.969000

**8. What is the lifetime average amount spent in terms of total_amt_usd, including only the companies that spent more per order, on average, than the average of all orders.**

In [188]:
# First find the general lifetime average for all orders

query_to_df(
"SELECT (SUM(orders.total_amt_usd) / COUNT(orders.total)) avg_general_order FROM orders;"
)

Query ran for 0.00997304916381836 secs!

  avg_general_order
0       3348.019651

In [189]:
# Then find the accounts whose lifetime average is > the general average

query_to_df(
"SELECT DISTINCT a.name acct_name, (SUM(o.total_amt_usd) / COUNT(o.total)) above_avg_avg \
FROM accounts a JOIN orders o ON o.account_id=a.id \
GROUP BY 1 HAVING (SUM(o.total_amt_usd) / COUNT(o.total)) \
> (SELECT (SUM(orders.total_amt_usd) / COUNT(orders.total)) avg_general_order FROM orders);"
)

Query ran for 0.13763213157653809 secs!

              acct_name above_avg_avg
0               Walmart   4429.102500
1    Berkshire Hathaway   7474.320000
2            CVS Health   3944.585000
3        General Motors   4997.525000
4            Ford Motor   4184.092703
..                  ...           ...
164          BorgWarner   3749.278182
165   Eversource Energy   5705.976000
166  Franklin Resources   3668.390270
167                 KKR   3954.070000
168                 PPL   3868.138966

[169 rows x 2 columns]

In [183]:
# Now find the lifetime average for all these companies together

query_to_df(
"SELECT AVG(above_avg_avg) above_avg_spenders_lifetime_avg FROM \
(SELECT DISTINCT a.name acct_name, (SUM(o.total_amt_usd) / COUNT(o.total)) above_avg_avg \
FROM accounts a JOIN orders o ON o.account_id=a.id \
GROUP BY 1 HAVING (SUM(o.total_amt_usd) / COUNT(o.total)) \
> (SELECT (SUM(orders.total_amt_usd) / COUNT(orders.total)) avg_general_order FROM orders)) AS avg;"
)

Query ran for 0.023936033248901367 secs!

  above_avg_spenders_lifetime_avg
0                 4721.1397439822